Name : ANMOL ARORA

Roll No. : 2301560043

Subject : AI_ML

Program : MCA(SOET)

Entire Code Is Available Here : https://github.com/ASquare04/AI_ML

### Data Cleaning in Pandas

In [1]:
import pandas as pd
from sklearn import preprocessing


data = {
    'name': ['John', 'Jane', 'John', 'Bob', 'Jane'],
    'job': ['Engineer', 'Manager', 'Engineer', 'Analyst', 'Manager'],
    'company': ['ABC Corp', 'XYZ Inc', 'ABC Corp', '123 Industries', 'XYZ Inc'],
    'street_address': ['123 Main St', '456 Oak Ave', '123 Main St', '789 Pine Rd', '456 Oak Ave'],
    'city': ['City1', 'City2', 'City1', 'City3', 'City2'],
    'state': ['CA', 'NY', 'CA', 'TX', 'NY'],
    'email': ['john@example.com', 'jane@example.com', 'john@example.com', 'bob@example.com', 'jane@example.com'],
    'user_name': ['john_doe', 'jane_smith', 'john_doe', 'bob_analyst', 'jane_smith']
}

df = pd.DataFrame(data)
subset_columns = ['name', 'job', 'company', 'street_address', 'city', 'state', 'email', 'user_name']
df_deduplicated = df.drop_duplicates(subset=subset_columns)
df_deduplicated

,name,job,company,street_address,city,state,email,user_name
0,John,Engineer,ABC Corp,123 Main St,City1,CA,john@example.com,john_doe
1,Jane,Manager,XYZ Inc,456 Oak Ave,City2,NY,jane@example.com,jane_smith
3,Bob,Analyst,123 Industries,789 Pine Rd,City3,TX,bob@example.com,bob_analyst

In [2]:
#pip install fuzzywuzzy

In [3]:
import pandas as pd
from fuzzywuzzy import fuzz, process
df = pd.DataFrame(data)
df

C:\Users\Anmol Arora\anaconda3\Lib\site-packages\fuzzywuzzy\fuzz.py:11: UserWarning: Using slow pure-python SequenceMatcher. Install python-Levenshtein to remove this warning
  warnings.warn('Using slow pure-python SequenceMatcher. Install python-Levenshtein to remove this warning')

,name,job,company,street_address,city,state,email,user_name
0,John,Engineer,ABC Corp,123 Main St,City1,CA,john@example.com,john_doe
1,Jane,Manager,XYZ Inc,456 Oak Ave,City2,NY,jane@example.com,jane_smith
2,John,Engineer,ABC Corp,123 Main St,City1,CA,john@example.com,john_doe
3,Bob,Analyst,123 Industries,789 Pine Rd,City3,TX,bob@example.com,bob_analyst
4,Jane,Manager,XYZ Inc,456 Oak Ave,City2,NY,jane@example.com,jane_smith

In [4]:
query_name = 'Jaanne'
matches = process.extract(query_name, df['name'], scorer=fuzz.token_sort_ratio)
best_match, score, _ = max(matches, key=lambda x: x[1])
threshold = 80
if score >= threshold:
    print(f"Best match for '{query_name}': '{best_match}' with a similarity score of {score}")
else:
    print(f"No close match found for '{query_name}'")

Best match for 'Jaanne': 'Jane' with a similarity score of 80

In [5]:
choices = ['Germany', 'Deutschland', 'France', 
           'United Kingdom', 'Great Britain', 
           'United States']
process.extract('UN', choices)

[('United Kingdom', 90),
 ('United States', 90),
 ('Germany', 45),
 ('Deutschland', 45),
 ('France', 45)]

In [6]:
process.extract('titainium', choices)

[('Great Britain', 55),
 ('United Kingdom', 43),
 ('Deutschland', 30),
 ('France', 30),
 ('United States', 27)]

In [7]:
process.extract('Un.S.', choices)

[('United States', 86),
 ('United Kingdom', 64),
 ('Deutschland', 45),
 ('Great Britain', 30),
 ('Germany', 26)]

In [8]:
import pandas as pd
from datetime import datetime
from sklearn.impute import SimpleImputer

hvac = pd.read_csv('HVAC_with_nulls.csv')

In [9]:
hvac.dtypes

Date           object
Time           object
TargetTemp    float64
ActualTemp      int64
System          int64
SystemAge     float64
BuildingID      int64
10            float64
dtype: object

In [10]:
hvac.shape

(8000, 8)

In [11]:
imp = SimpleImputer(strategy='mean')

In [12]:
hvac_numeric = hvac[['TargetTemp', 'SystemAge']]

In [13]:
transformed = imp.fit_transform(hvac_numeric)

In [14]:
hvac[['TargetTemp', 'SystemAge']] = transformed
hvac.head(10)

      Date     Time  TargetTemp  ActualTemp  System  SystemAge  BuildingID  10
0   6/1/13  0:00:01   66.000000          58      13  20.000000           4 NaN
1   6/2/13  1:00:01   67.507735          68       3  20.000000          17 NaN
2   6/3/13  2:00:01   70.000000          73      17  20.000000          18 NaN
3   6/4/13  3:00:01   67.000000          63       2  15.386643          15 NaN
4   6/5/13  4:00:01   68.000000          74      16   9.000000           3 NaN
5   6/6/13  5:00:01   67.000000          56      13  28.000000           4 NaN
6   6/7/13  6:00:01   70.000000          58      12  24.000000           2 NaN
7   6/8/13  7:00:01   67.507735          73      20  26.000000          16 NaN
8   6/9/13  8:00:01   66.000000          69      16   9.000000           9 NaN
9  6/10/13  9:00:01   65.000000          57       6   5.000000          12 NaN

In [15]:
hvac['ScaledTemp'] = preprocessing.scale(hvac['ActualTemp'])

In [16]:
hvac['ScaledTemp'].head()

0   -1.293272
1    0.048732
2    0.719733
3   -0.622270
4    0.853934
Name: ScaledTemp, dtype: float64

In [17]:
min_max_scaler = preprocessing.MinMaxScaler()

In [18]:
temp_minmax = min_max_scaler.fit_transform(hvac[['ActualTemp']])
temp_minmax

array([[0.12],
       [0.52],
       [0.72],
       ...,
       [0.56],
       [0.32],
       [0.44]])